// Написать приложение, отображающее галерею картинок:
// - картинки должны отображаться в виде квадратной сетки, количество колонок в которой зависит от ширины экрана;
// - картинки должны загружаться с Pixabay API;
// - под каждой картинкой должно отображаться количество лайков и просмотров данной картинки;
// - при пролистывании галереи вниз картинки должны догружаться автоматически;
// - должно иметься поле поиска, ввод данных в которое с дебаунсом (debounce) обновляет отображаемую галерею на результаты вписанного в поиск запроса;
// - нажатие на картинку должно анимировано открыть картинку во весь экран, откуда должна быть возможность вернуться в исходное состояние.


// Требования к коду:
// - приложение должно быть написано на Flutter'е и работать на всех платформах;
// - приложение должно быть покрыто базовыми E2E тестами;
// - веб-версия приложения должна быть развёрнута на GitHub Pages.